"""
[Title/Звание]
    TryNotToRust
[Description/Обрисовка]
    Игра в която посредством камерата играча трябва да улавя с уста валящи от небето 
    дамаджани с ракия и същевременно да избягва шишета с вода, за да не ръждяса.
[Functionalities/Надарености]
    Това ще е десктоп приложение, в което потребителя ще може:
        -да започва нова игра, да запазва резултат в локален лидерборд 
         и да го разглежда по-късно
        -по време на игра да получава маска и по нея да следи своето ниво на ръжда
        -впрягайки гъвкавостта на врата и устата си да улавя колкото се може повече 
         дамаджани с ракия докато избягва шишета с вода. Това ще става като програмата
         следи за позицията на устата на играча и когато тя съвпадне с локацията на дамаджана 
         ще му бъдат давани точки, а когато тя попадне на вода ще му бъдат вземани точки и
         маската му ще бъде разменяна с по-ръждива
        -при края на играта когато той е прекалил с водата и напълно е ръждясал, ще има 
         възможността да запази своя резултат в лидерборда както и да започне нова игра.
[Milestones/Възлови точки]
Модул за обработка на видеото
    Модул за рендърване на маска
    Модул за следене на позицията на устата
Модул за комуникация с камерата
Интерфейс
Модул за game логиката
    Модул за играча
    Модул за обектите
[Estimate in man-hours/Времеоценка в човекочасове]
    50-60 часа
[Usage of technologies/Потребление на технологии]
    OpenCV и Mediapipe за работа с камерата, обработка на кадрите и
    face landmark detection за рендърването на маската
    OpenCVGUI или PyQt ако първото не е достатъчно
"""